app/controllers/monitoring_controller.rb

SELECT "pets".* FROM "pets" WHERE "pets"."id" = 1 LIMIT 1
UPDATE "pets" SET "updated_at" = '2026-05-07 14:48:41.916280', "weight" = 2.0 WHERE "pets"."id" = 1
UPDATE "pets" SET "updated_at" = '2026-05-07 14:48:57.649831', "temperature" = 38.0 WHERE "pets"."id" = 1
INSERT INTO "monitorings" ("type", "method", "unit", "data", "created_at", "updated_at", "user_id", "pet_id") VALUES (1, NULL, NULL, 38.0, '2026-05-07 14:48:57.660174', '2026-05-07 14:48:57.660174', NULL, 1) RETURNING "id"
SELECT "monitorings".* FROM "monitorings" WHERE "monitorings"."pet_id" = 1 AND "monitorings"."type" = 0 ORDER BY "monitorings"."created_at" ASC LIMIT 10
---
  def create
    @pet = Pet.find(params[:pet_id])
    # The 'result' from the frontend corresponds to the 'data' column in the database
    @monitoring = @pet.monitorings.new(type: params[:type], data: params[:result])
    if params[:type] == 0
      @pet.update(weight: params[:result])
    elsif params[:type] == 1
      @pet.update(temperature: params[:result])
    end

    if @monitoring.save
      render json: {
        monitoring: Monitoring.where(pet_id: @pet.id, type: params[:type]).order(created_at: :desc).limit(10).reverse_order.map { |m| { date: m.created_at.strftime('%Y-%m-%d'), value: m.data } },
        error: nil,
        type: params[:type],
      }