app/controllers/owner_controller.rb

  def index
    @pagy, @records = pagy(
      Pet.all.includes(:user, :species)
      .where(users: { id: current_user.id })
      .order(:name),
    )
    render inertia: {
      pets: InertiaRails.scroll(@pagy) { @records.as_json() },
      user: current_user,
      species: Species.all.map(&:as_json),
      genders: Pet.genders.map do |k, v|
---
SELECT "users".* FROM "users" WHERE "users"."id" = 1 ORDER BY "users"."id" ASC LIMIT 1
SELECT "species".* FROM "species"