app/controllers/pet_controller.rb

  def create
    @pet = Pet.new(pet_params)
    @pet.user = current_user
    @pet.owner_phone = current_user.phone_number

    if @pet.save
---
INSERT INTO "pets" ("name", "species_id", "user_id", "birth_date", "gender", "color", "rfid", "sterilized", "created_at", "updated_at", "weight", "status", "temperature") VALUES ('Ruki', 1, 1, '2026-05-01', 1, 'Hijau', NULL, FALSE, '2026-05-07 14:45:00.234226', '2026-05-07 14:45:00.234226', NULL, NULL, NULL) RETURNING "id"

  def update
    @pet = Pet.find_by(user_id: current_user.id, id: params[:id])
    if @pet.update(pet_params)
---
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = 1 AND "pets"."id" = 1 LIMIT 1
UPDATE "pets" SET "name" = 'Ruka', "updated_at" = '2026-05-07 14:50:43.951398' WHERE "pets"."id" = 1

  def details
    @pet = Pet.find_by(user_id: current_user.id, id: params[:pet_id])
    @weights = Monitoring.where(pet_id: @pet.id, type: :weight).where.not(data: nil).order(created_at: :desc).limit(10).reverse_order.map { |m| { date: m.created_at.strftime('%Y-%m-%d'), value: m.data } }
    @temperatures = Monitoring.where(pet_id: @pet.id, type: :temperature).where.not(data: nil).order(created_at: :desc).limit(10).reverse_order.map { |m| { date: m.created_at.strftime('%Y-%m-%d'), value: m.data } }
    @monitor = Monitoring.types.map { |label, type| { label: label, value: type } }
    @species = Species.all.map { |s| { label: s.name, value: s.id } }
---
SELECT "pets".* FROM "pets" WHERE "pets"."user_id" = 1 AND "pets"."id" = 1 LIMIT 1
SELECT "monitorings".* FROM "monitorings" WHERE "monitorings"."pet_id" = 1 AND "monitorings"."type" = 1 AND "monitorings"."data" IS NOT NULL ORDER BY "monitorings"."created_at" ASC LIMIT 10
SELECT "species".* FROM "species"