app/controllers/vet_controller.rb

INSERT INTO "vets" ("name", "phone", "address", "email", "created_at", "updated_at") VALUES ('Rumana', '085815723989', 'Jl. Rumana', 'rumana@rumana.id', '2026-05-07 15:03:54.164761', '2026-05-07 15:03:54.164761') RETURNING "id"
---
  def create
    @vet = Vet.new(vet_params)
    @user = current_user
    @user.vet = @vet
    @user.vet_role = :administrator

    if @vet.save && @user.save