app/models/pet.rb

SELECT "users".* FROM "users" WHERE "users"."phone_number" = '6281234567890' LIMIT 1
---
  def link_user_by_phone
    self.user = User.find_by(phone_number: owner_phone)