app/models/user.rb

  def assign_default_role
    self.add_role(:user) if self.roles.blank?
---
SELECT "roles".* FROM "roles" INNER JOIN "users_roles" ON "roles"."id" = "users_roles"."role_id" WHERE "users_roles"."user_id" = 1

  def claim_unowned_pets
    Pet.where(owner_phone: phone_number, user_id: nil).update_all(user_id: id)
---
UPDATE "pets" SET "user_id" = 1 WHERE "pets"."owner_phone" = '6281234567890' AND "pets"."user_id" IS NULL